// Задача 4: Напишите программу, которая принимает на
// вход цифру, обозначающую день недели, и проверяет,
// является ли этот день выходным.

string s_a = Console.ReadLine()!;
if (s_a == "1") Console.WriteLine("Будний день");
else if (s_a == "2") Console.WriteLine("Будний день");
else if (s_a == "3") Console.WriteLine("Будний день");
else if (s_a == "4") Console.WriteLine("Будний день");
else if (s_a == "5") Console.WriteLine("Ура!!!Пятницааа!!!");
else if (s_a == "6") Console.WriteLine("Выходной");
else if (s_a == "7") Console.WriteLine("Выходной");
else Console.WriteLine("Ошибка");
